{
  "packageName": "javax.xml.transform",
  "simpleName": "Templates",
  "moduleName": "java.xml",
  "type": "INTERFACE",
  "superClass": {
    "name": "java.lang.Object",
    "type": "Class"
  },
  "members": [
    {
      "returnType": {
        "name": "javax.xml.transform.Transformer",
        "type": "Class"
      },
      "throwsClasses": [
        {
          "name": "javax.xml.transform.TransformerConfigurationException",
          "type": "Class"
        }
      ],
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "newTransformer",
      "comment": "Create a new transformation context for this Templates object.",
      "tagMap": {
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.xml/javax/xml/transform/TransformerConfigurationException.html\" title\u003d\"class in javax.xml.transform\"\u003eTransformerConfigurationException\u003c/a\u003e\u003c/code\u003e - if a Transformer can not be created."
        ],
        "return": [
          "A valid non-null instance of a Transformer."
        ]
      }
    },
    {
      "returnType": {
        "name": "java.util.Properties",
        "type": "Class"
      },
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "getOutputProperties",
      "comment": "Get the properties corresponding to the effective xsl:output element. The object returned will be a clone of the internal values. Accordingly, it can be mutated without mutating the Templates object, and then handed in to Transformer.setOutputProperties(java.util.Properties). The properties returned should contain properties set by the stylesheet, and these properties are \"defaulted\" by default properties specified by section 16 of the XSL Transformations (XSLT) W3C Recommendation. The properties that were specifically set by the stylesheet should be in the base Properties list, while the XSLT default properties that were not specifically set should be in the \"default\" Properties list. Thus, getOutputProperties().getProperty(String key) will obtain any property in that was set by the stylesheet, or the default properties, while getOutputProperties().get(String key) will only retrieve properties that were explicitly set in the stylesheet. For XSLT, Attribute Value Templates attribute values will be returned unexpanded (since there is no context at this point). The namespace prefixes inside Attribute Value Templates will be unexpanded, so that they remain valid XPath values.",
      "tagMap": {
        "return": [
          "A Properties object, never null."
        ]
      }
    }
  ],
  "memberType": "JavaClass",
  "modifiers": 513,
  "name": "javax.xml.transform.Templates",
  "comment": "An object that implements this interface is the runtime representation of processed transformation instructions. \n\u003cp\u003eTemplates must be threadsafe for a given instance over multiple threads running concurrently, and may be used multiple times in a given session.\u003c/p\u003e",
  "tagMap": {
    "since": [
      "1.4"
    ]
  }
}