{
  "packageName": "java.net",
  "simpleName": "IDN",
  "moduleName": "java.base",
  "type": "CLASS",
  "superClass": {
    "name": "java.lang.Object",
    "type": "Class"
  },
  "members": [
    {
      "type": {
        "name": "int",
        "type": "Class"
      },
      "memberType": "JavaField",
      "modifiers": 25,
      "name": "ALLOW_UNASSIGNED",
      "comment": "Flag to allow processing of unassigned code points",
      "annotations": [],
      "tagMap": {
        "see": [
          "\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/constant-values.html#java.net.IDN.ALLOW_UNASSIGNED\"\u003eConstant Field Values\u003c/a\u003e"
        ]
      }
    },
    {
      "type": {
        "name": "int",
        "type": "Class"
      },
      "memberType": "JavaField",
      "modifiers": 25,
      "name": "USE_STD3_ASCII_RULES",
      "comment": "Flag to turn on the check against STD-3 ASCII rules",
      "annotations": [],
      "tagMap": {
        "see": [
          "\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/constant-values.html#java.net.IDN.USE_STD3_ASCII_RULES\"\u003eConstant Field Values\u003c/a\u003e"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.lang.String",
        "type": "Class"
      },
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "toASCII",
      "comment": "Translates a string from Unicode to ASCII Compatible Encoding (ACE), as defined by the ToASCII operation of RFC 3490. ToASCII operation can fail. ToASCII fails if any step of it fails. If ToASCII operation fails, an IllegalArgumentException will be thrown. In this case, the input string should not be used in an internationalized domain name. A label is an individual part of a domain name. The original ToASCII operation, as defined in RFC 3490, only operates on a single label. This method can handle both label and entire domain name, by assuming that labels in a domain name are always separated by dots. The following characters are recognized as dots: \\u002E (full stop), \\u3002 (ideographic full stop), \\uFF0E (fullwidth full stop), and \\uFF61 (halfwidth ideographic full stop). if dots are used as label separators, this method also changes all of them to \\u002E (full stop) in output translated string.",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003einput\u003c/code\u003e - the string to be processed",
          "\u003ccode\u003eflag\u003c/code\u003e - process flag; can be 0 or any logical OR of possible flags"
        ],
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/lang/IllegalArgumentException.html\" title\u003d\"class in java.lang\"\u003eIllegalArgumentException\u003c/a\u003e\u003c/code\u003e - if the input string doesn\u0027t conform to RFC 3490 specification"
        ],
        "return": [
          "the translated \n\u003ccode\u003eString\u003c/code\u003e"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.lang.String",
        "type": "Class"
      },
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "toASCII",
      "comment": "Translates a string from Unicode to ASCII Compatible Encoding (ACE), as defined by the ToASCII operation of RFC 3490. This convenience method works as if by invoking the two-argument counterpart as follows: toASCII(input, 0);",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003einput\u003c/code\u003e - the string to be processed"
        ],
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/lang/IllegalArgumentException.html\" title\u003d\"class in java.lang\"\u003eIllegalArgumentException\u003c/a\u003e\u003c/code\u003e - if the input string doesn\u0027t conform to RFC 3490 specification"
        ],
        "return": [
          "the translated \n\u003ccode\u003eString\u003c/code\u003e"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.lang.String",
        "type": "Class"
      },
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "toUnicode",
      "comment": "Translates a string from ASCII Compatible Encoding (ACE) to Unicode, as defined by the ToUnicode operation of RFC 3490. ToUnicode never fails. In case of any error, the input string is returned unmodified. A label is an individual part of a domain name. The original ToUnicode operation, as defined in RFC 3490, only operates on a single label. This method can handle both label and entire domain name, by assuming that labels in a domain name are always separated by dots. The following characters are recognized as dots: \\u002E (full stop), \\u3002 (ideographic full stop), \\uFF0E (fullwidth full stop), and \\uFF61 (halfwidth ideographic full stop).",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003einput\u003c/code\u003e - the string to be processed",
          "\u003ccode\u003eflag\u003c/code\u003e - process flag; can be 0 or any logical OR of possible flags"
        ],
        "return": [
          "the translated \n\u003ccode\u003eString\u003c/code\u003e"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.lang.String",
        "type": "Class"
      },
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "toUnicode",
      "comment": "Translates a string from ASCII Compatible Encoding (ACE) to Unicode, as defined by the ToUnicode operation of RFC 3490. This convenience method works as if by invoking the two-argument counterpart as follows: toUnicode(input, 0);",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003einput\u003c/code\u003e - the string to be processed"
        ],
        "return": [
          "the translated \n\u003ccode\u003eString\u003c/code\u003e"
        ]
      }
    }
  ],
  "memberType": "JavaClass",
  "modifiers": 17,
  "name": "java.net.IDN",
  "comment": "Provides methods to convert internationalized domain names (IDNs) between a normal Unicode representation and an ASCII Compatible Encoding (ACE) representation. Internationalized domain names can use characters from the entire range of Unicode, while traditional domain names are restricted to ASCII characters. ACE is an encoding of Unicode strings that uses only ASCII characters and can be used with software (such as the Domain Name System) that only understands traditional domain names. \n\u003cp\u003eInternationalized domain names are defined in \u003ca href\u003d\"http://www.ietf.org/rfc/rfc3490.txt\"\u003eRFC 3490\u003c/a\u003e. RFC 3490 defines two operations: ToASCII and ToUnicode. These 2 operations employ \u003ca href\u003d\"http://www.ietf.org/rfc/rfc3491.txt\"\u003eNameprep\u003c/a\u003e algorithm, which is a profile of \u003ca href\u003d\"http://www.ietf.org/rfc/rfc3454.txt\"\u003eStringprep\u003c/a\u003e, and \u003ca href\u003d\"http://www.ietf.org/rfc/rfc3492.txt\"\u003ePunycode\u003c/a\u003e algorithm to convert domain name string back and forth. \u003c/p\u003e\n\u003cp\u003eThe behavior of aforementioned conversion process can be adjusted by various flags: \u003c/p\u003e\n\u003cul\u003e \n \u003cli\u003eIf the ALLOW_UNASSIGNED flag is used, the domain name string to be converted can contain code points that are unassigned in Unicode 3.2, which is the Unicode version on which IDN conversion is based. If the flag is not used, the presence of such unassigned code points is treated as an error. \u003c/li\u003e\n \u003cli\u003eIf the USE_STD3_ASCII_RULES flag is used, ASCII strings are checked against \u003ca href\u003d\"http://www.ietf.org/rfc/rfc1122.txt\"\u003eRFC 1122\u003c/a\u003e and \u003ca href\u003d\"http://www.ietf.org/rfc/rfc1123.txt\"\u003eRFC 1123\u003c/a\u003e. It is an error if they don\u0027t meet the requirements. \u003c/li\u003e\n\u003c/ul\u003e These flags can be logically OR\u0027ed together. \n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe security consideration is important with respect to internationalization domain name support. For example, English domain names may be \u003ci\u003ehomographed\u003c/i\u003e - maliciously misspelled by substitution of non-Latin letters. \u003ca href\u003d\"http://www.unicode.org/reports/tr36/\"\u003eUnicode Technical Report #36\u003c/a\u003e discusses security issues of IDN support as well as possible solutions. Applications are responsible for taking adequate security measures when using international domain names.\u003c/p\u003e",
  "tagMap": {
    "since": [
      "1.6"
    ]
  }
}