{
  "packageName": "java.time.zone",
  "simpleName": "ZoneRulesProvider",
  "moduleName": "java.base",
  "type": "CLASS",
  "superClass": {
    "name": "java.lang.Object",
    "type": "Class"
  },
  "members": [
    {
      "returnType": {
        "name": "java.util.Set",
        "parameters": [
          {
            "name": "java.lang.String",
            "type": "Class"
          }
        ],
        "type": "Class"
      },
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "getAvailableZoneIds",
      "comment": "Gets the set of available zone IDs. These IDs are the string form of a ZoneId.",
      "tagMap": {
        "return": [
          "the unmodifiable set of zone IDs, not null"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.time.zone.ZoneRules",
        "type": "Class"
      },
      "parameters": [
        {
          "type": {
            "name": "java.lang.String",
            "type": "Class"
          },
          "field": {
            "name": "zoneId"
          }
        },
        {
          "type": {
            "name": "boolean",
            "type": "Class"
          },
          "field": {
            "name": "forCaching"
          }
        }
      ],
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "getRules",
      "comment": "Gets the rules for the zone ID. This returns the latest available rules for the zone ID. This method relies on time-zone data provider files that are configured. These are loaded using a ServiceLoader. The caching flag is designed to allow provider implementations to prevent the rules being cached in ZoneId. Under normal circumstances, the caching of zone rules is highly desirable as it will provide greater performance. However, there is a use case where the caching would not be desirable, see provideRules(java.lang.String, boolean).",
      "tagMap": {
        "param": [
          "\u003ccode\u003ezoneId\u003c/code\u003e - the zone ID as defined by \n\u003ccode\u003eZoneId\u003c/code\u003e, not null",
          "\u003ccode\u003eforCaching\u003c/code\u003e - whether the rules are being queried for caching, true if the returned rules will be cached by \n\u003ccode\u003eZoneId\u003c/code\u003e, false if they will be returned to the user without being cached in \n\u003ccode\u003eZoneId\u003c/code\u003e"
        ],
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/time/zone/ZoneRulesException.html\" title\u003d\"class in java.time.zone\"\u003eZoneRulesException\u003c/a\u003e\u003c/code\u003e - if rules cannot be obtained for the zone ID"
        ],
        "return": [
          "the rules, null if \n\u003ccode\u003eforCaching\u003c/code\u003e is true and this is a dynamic provider that wants to prevent caching in \n\u003ccode\u003eZoneId\u003c/code\u003e, otherwise not null"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.util.NavigableMap",
        "parameters": [
          {
            "name": "java.lang.String",
            "type": "Class"
          },
          {
            "name": "java.time.zone.ZoneRules",
            "type": "Class"
          }
        ],
        "type": "Class"
      },
      "parameters": [
        {
          "type": {
            "name": "java.lang.String",
            "type": "Class"
          },
          "field": {
            "name": "zoneId"
          }
        }
      ],
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "getVersions",
      "comment": "Gets the history of rules for the zone ID. Time-zones are defined by governments and change frequently. This method allows applications to find the history of changes to the rules for a single zone ID. The map is keyed by a string, which is the version string associated with the rules. The exact meaning and format of the version is provider specific. The version must follow lexicographical order, thus the returned map will be order from the oldest known rules to the newest available rules. The default \u0027TZDB\u0027 group uses version numbering consisting of the year followed by a letter, such as \u00272009e\u0027 or \u00272012f\u0027. Implementations must provide a result for each valid zone ID, however they do not have to provide a history of rules. Thus the map will always contain one element, and will only contain more than one element if historical rule information is available.",
      "tagMap": {
        "param": [
          "\u003ccode\u003ezoneId\u003c/code\u003e - the zone ID as defined by \n\u003ccode\u003eZoneId\u003c/code\u003e, not null"
        ],
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/time/zone/ZoneRulesException.html\" title\u003d\"class in java.time.zone\"\u003eZoneRulesException\u003c/a\u003e\u003c/code\u003e - if history cannot be obtained for the zone ID"
        ],
        "return": [
          "a modifiable copy of the history of the rules for the ID, sorted from oldest to newest, not null"
        ]
      }
    },
    {
      "returnType": {
        "name": "void",
        "type": "Class"
      },
      "parameters": [
        {
          "type": {
            "name": "java.time.zone.ZoneRulesProvider",
            "type": "Class"
          },
          "field": {
            "name": "provider"
          }
        }
      ],
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "registerProvider",
      "comment": "Registers a zone rules provider. This adds a new provider to those currently available. A provider supplies rules for one or more zone IDs. A provider cannot be registered if it supplies a zone ID that has already been registered. See the notes on time-zone IDs in ZoneId, especially the section on using the concept of a \"group\" to make IDs unique. To ensure the integrity of time-zones already created, there is no way to deregister providers.",
      "tagMap": {
        "param": [
          "\u003ccode\u003eprovider\u003c/code\u003e - the provider to register, not null"
        ],
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/time/zone/ZoneRulesException.html\" title\u003d\"class in java.time.zone\"\u003eZoneRulesException\u003c/a\u003e\u003c/code\u003e - if a zone ID is already registered"
        ]
      }
    },
    {
      "returnType": {
        "name": "boolean",
        "type": "Class"
      },
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "refresh",
      "comment": "Refreshes the rules from the underlying data provider. This method allows an application to request that the providers check for any updates to the provided rules. After calling this method, the offset stored in any ZonedDateTime may be invalid for the zone ID. Dynamic update of rules is a complex problem and most applications should not use this method or dynamic rules. To achieve dynamic rules, a provider implementation will have to be written as per the specification of this class. In addition, instances of ZoneRules must not be cached in the application as they will become stale. However, the boolean flag on provideRules(String, boolean) allows provider implementations to control the caching of ZoneId, potentially ensuring that all objects in the system see the new rules. Note that there is likely to be a cost in performance of a dynamic rules provider. Note also that no dynamic rules provider is in this specification.",
      "tagMap": {
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/time/zone/ZoneRulesException.html\" title\u003d\"class in java.time.zone\"\u003eZoneRulesException\u003c/a\u003e\u003c/code\u003e - if an error occurs during the refresh"
        ],
        "return": [
          "true if the rules were updated"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.util.Set",
        "parameters": [
          {
            "name": "java.lang.String",
            "type": "Class"
          }
        ],
        "type": "Class"
      },
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 1028,
      "name": "provideZoneIds",
      "comment": "SPI method to get the available zone IDs. This obtains the IDs that this ZoneRulesProvider provides. A provider should provide data for at least one zone ID. The returned zone IDs remain available and valid for the lifetime of the application. A dynamic provider may increase the set of IDs as more data becomes available.",
      "tagMap": {
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/time/zone/ZoneRulesException.html\" title\u003d\"class in java.time.zone\"\u003eZoneRulesException\u003c/a\u003e\u003c/code\u003e - if a problem occurs while providing the IDs"
        ],
        "return": [
          "the set of zone IDs being provided, not null"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.time.zone.ZoneRules",
        "type": "Class"
      },
      "parameters": [
        {
          "type": {
            "name": "java.lang.String",
            "type": "Class"
          },
          "field": {
            "name": "zoneId"
          }
        },
        {
          "type": {
            "name": "boolean",
            "type": "Class"
          },
          "field": {
            "name": "forCaching"
          }
        }
      ],
      "memberType": "JavaMethod",
      "modifiers": 1028,
      "name": "provideRules",
      "comment": "SPI method to get the rules for the zone ID. This loads the rules for the specified zone ID. The provider implementation must validate that the zone ID is valid and available, throwing a ZoneRulesException if it is not. The result of the method in the valid case depends on the caching flag. If the provider implementation is not dynamic, then the result of the method must be the non-null set of rules selected by the ID. If the provider implementation is dynamic, then the flag gives the option of preventing the returned rules from being cached in ZoneId. When the flag is true, the provider is permitted to return null, where null will prevent the rules from being cached in ZoneId. When the flag is false, the provider must return non-null rules.",
      "tagMap": {
        "param": [
          "\u003ccode\u003ezoneId\u003c/code\u003e - the zone ID as defined by \n\u003ccode\u003eZoneId\u003c/code\u003e, not null",
          "\u003ccode\u003eforCaching\u003c/code\u003e - whether the rules are being queried for caching, true if the returned rules will be cached by \n\u003ccode\u003eZoneId\u003c/code\u003e, false if they will be returned to the user without being cached in \n\u003ccode\u003eZoneId\u003c/code\u003e"
        ],
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/time/zone/ZoneRulesException.html\" title\u003d\"class in java.time.zone\"\u003eZoneRulesException\u003c/a\u003e\u003c/code\u003e - if rules cannot be obtained for the zone ID"
        ],
        "return": [
          "the rules, null if \n\u003ccode\u003eforCaching\u003c/code\u003e is true and this is a dynamic provider that wants to prevent caching in \n\u003ccode\u003eZoneId\u003c/code\u003e, otherwise not null"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.util.NavigableMap",
        "parameters": [
          {
            "name": "java.lang.String",
            "type": "Class"
          },
          {
            "name": "java.time.zone.ZoneRules",
            "type": "Class"
          }
        ],
        "type": "Class"
      },
      "parameters": [
        {
          "type": {
            "name": "java.lang.String",
            "type": "Class"
          },
          "field": {
            "name": "zoneId"
          }
        }
      ],
      "memberType": "JavaMethod",
      "modifiers": 1028,
      "name": "provideVersions",
      "comment": "SPI method to get the history of rules for the zone ID. This returns a map of historical rules keyed by a version string. The exact meaning and format of the version is provider specific. The version must follow lexicographical order, thus the returned map will be order from the oldest known rules to the newest available rules. The default \u0027TZDB\u0027 group uses version numbering consisting of the year followed by a letter, such as \u00272009e\u0027 or \u00272012f\u0027. Implementations must provide a result for each valid zone ID, however they do not have to provide a history of rules. Thus the map will contain at least one element, and will only contain more than one element if historical rule information is available. The returned versions remain available and valid for the lifetime of the application. A dynamic provider may increase the set of versions as more data becomes available.",
      "tagMap": {
        "param": [
          "\u003ccode\u003ezoneId\u003c/code\u003e - the zone ID as defined by \n\u003ccode\u003eZoneId\u003c/code\u003e, not null"
        ],
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/time/zone/ZoneRulesException.html\" title\u003d\"class in java.time.zone\"\u003eZoneRulesException\u003c/a\u003e\u003c/code\u003e - if history cannot be obtained for the zone ID"
        ],
        "return": [
          "a modifiable copy of the history of the rules for the ID, sorted from oldest to newest, not null"
        ]
      }
    },
    {
      "returnType": {
        "name": "boolean",
        "type": "Class"
      },
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 4,
      "name": "provideRefresh",
      "comment": "SPI method to refresh the rules from the underlying data provider. This method provides the opportunity for a provider to dynamically recheck the underlying data provider to find the latest rules. This could be used to load new rules without stopping the JVM. Dynamic behavior is entirely optional and most providers do not support it. This implementation returns false.",
      "tagMap": {
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/time/zone/ZoneRulesException.html\" title\u003d\"class in java.time.zone\"\u003eZoneRulesException\u003c/a\u003e\u003c/code\u003e - if an error occurs during the refresh"
        ],
        "return": [
          "true if the rules were updated"
        ]
      }
    },
    {
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 4,
      "comment": "Constructor.",
      "tagMap": {}
    }
  ],
  "memberType": "JavaClass",
  "modifiers": 1025,
  "name": "java.time.zone.ZoneRulesProvider",
  "comment": "Provider of time-zone rules to the system. \n\u003cp\u003e This class manages the configuration of time-zone rules. The static methods provide the public API that can be used to manage the providers. The abstract methods provide the SPI that allows rules to be provided. \u003c/p\u003e\n\u003cp\u003e ZoneRulesProvider may be installed in an instance of the Java Platform as extension classes, that is, jar files placed into any of the usual extension directories. Installed providers are loaded using the service-provider loading facility defined by the \u003ca href\u003d\"../../util/ServiceLoader.html\" title\u003d\"class in java.util\"\u003e\u003ccode\u003eServiceLoader\u003c/code\u003e\u003c/a\u003e class. A ZoneRulesProvider identifies itself with a provider configuration file named \u003ccode\u003ejava.time.zone.ZoneRulesProvider\u003c/code\u003e in the resource directory \u003ccode\u003eMETA-INF/services\u003c/code\u003e. The file should contain a line that specifies the fully qualified concrete zonerules-provider class name. Providers may also be made available by adding them to the class path or by registering themselves via \u003ca href\u003d\"#registerProvider(java.time.zone.ZoneRulesProvider)\"\u003e\u003ccode\u003eregisterProvider(java.time.zone.ZoneRulesProvider)\u003c/code\u003e\u003c/a\u003e method. \u003c/p\u003e\n\u003cp\u003e The Java virtual machine has a default provider that provides zone rules for the time-zones defined by IANA Time Zone Database (TZDB). If the system property \u003ccode\u003e\u003cspan id\u003d\"java.time.zone.DefaultZoneRulesProvider\" class\u003d\"search-tag-result\"\u003ejava.time.zone.DefaultZoneRulesProvider\u003c/span\u003e\u003c/code\u003e is defined then it is taken to be the fully-qualified name of a concrete ZoneRulesProvider class to be loaded as the default provider, using the system class loader. If this system property is not defined, a system-default provider will be loaded to serve as the default provider. \u003c/p\u003e\n\u003cp\u003e Rules are looked up primarily by zone ID, as used by \u003ca href\u003d\"../ZoneId.html\" title\u003d\"class in java.time\"\u003e\u003ccode\u003eZoneId\u003c/code\u003e\u003c/a\u003e. Only zone region IDs may be used, zone offset IDs are not used here. \u003c/p\u003e\n\u003cp\u003e Time-zone rules are political, thus the data can change at any time. Each provider will provide the latest rules for each zone ID, but they may also provide the history of how the rules changed.\u003c/p\u003e",
  "tagMap": {
    "implSpec": [
      "This interface is a service provider that can be called by multiple threads. Implementations must be immutable and thread-safe. \n\u003cp\u003e Providers must ensure that once a rule has been seen by the application, the rule must continue to be available. \u003c/p\u003e\n\u003cp\u003e Providers are encouraged to implement a meaningful \u003ccode\u003etoString\u003c/code\u003e method. \u003c/p\u003e\n\u003cp\u003e Many systems would like to update time-zone rules dynamically without stopping the JVM. When examined in detail, this is a complex problem. Providers may choose to handle dynamic updates, however the default provider does not.\u003c/p\u003e"
    ],
    "since": [
      "1.8"
    ]
  }
}