{
  "packageName": "java.awt.dnd",
  "simpleName": "Autoscroll",
  "moduleName": "java.desktop",
  "type": "INTERFACE",
  "superClass": {
    "name": "java.lang.Object",
    "type": "Class"
  },
  "members": [
    {
      "returnType": {
        "name": "java.awt.Insets",
        "type": "Class"
      },
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "getAutoscrollInsets",
      "comment": "This method returns the Insets describing the autoscrolling region or border relative to the geometry of the implementing Component. This value is read once by the DropTarget upon entry of the drag Cursor into the associated Component.",
      "tagMap": {
        "return": [
          "the Insets"
        ]
      }
    },
    {
      "returnType": {
        "name": "void",
        "type": "Class"
      },
      "parameters": [
        {
          "type": {
            "name": "java.awt.Point",
            "type": "Class"
          },
          "field": {
            "name": "cursorLocn"
          }
        }
      ],
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "autoscroll",
      "comment": "notify the Component to autoscroll",
      "tagMap": {
        "param": [
          "\u003ccode\u003ecursorLocn\u003c/code\u003e - A \n\u003ccode\u003ePoint\u003c/code\u003e indicating the location of the cursor that triggered this operation."
        ]
      }
    }
  ],
  "memberType": "JavaClass",
  "modifiers": 513,
  "name": "java.awt.dnd.Autoscroll",
  "comment": "During DnD operations it is possible that a user may wish to drop the subject of the operation on a region of a scrollable GUI control that is not currently visible to the user. \n\u003cp\u003e In such situations it is desirable that the GUI control detect this and institute a scroll operation in order to make obscured region(s) visible to the user. This feature is known as autoscrolling. \u003c/p\u003e\n\u003cp\u003e If a GUI control is both an active \u003ccode\u003eDropTarget\u003c/code\u003e and is also scrollable, it can receive notifications of autoscrolling gestures by the user from the DnD system by implementing this interface. \u003c/p\u003e\n\u003cp\u003e An autoscrolling gesture is initiated by the user by keeping the drag cursor motionless with a border region of the \u003ccode\u003eComponent\u003c/code\u003e, referred to as the \"autoscrolling region\", for a predefined period of time, this will result in repeated scroll requests to the \u003ccode\u003eComponent\u003c/code\u003e until the drag \u003ccode\u003eCursor\u003c/code\u003e resumes its motion.\u003c/p\u003e",
  "tagMap": {
    "since": [
      "1.2"
    ]
  }
}