{
  "packageName": "java.util.concurrent.locks",
  "simpleName": "ReadWriteLock",
  "moduleName": "java.base",
  "type": "INTERFACE",
  "superClass": {
    "name": "java.lang.Object",
    "type": "Class"
  },
  "members": [
    {
      "returnType": {
        "name": "java.util.concurrent.locks.Lock",
        "type": "Class"
      },
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "readLock",
      "comment": "Returns the lock used for reading.",
      "tagMap": {
        "return": [
          "the lock used for reading"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.util.concurrent.locks.Lock",
        "type": "Class"
      },
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "writeLock",
      "comment": "Returns the lock used for writing.",
      "tagMap": {
        "return": [
          "the lock used for writing"
        ]
      }
    }
  ],
  "memberType": "JavaClass",
  "modifiers": 513,
  "name": "java.util.concurrent.locks.ReadWriteLock",
  "comment": "A \n\u003ccode\u003eReadWriteLock\u003c/code\u003e maintains a pair of associated \n\u003ca href\u003d\"Lock.html\" title\u003d\"interface in java.util.concurrent.locks\"\u003e\u003ccode\u003elocks\u003c/code\u003e\u003c/a\u003e, one for read-only operations and one for writing. The \n\u003ca href\u003d\"#readLock()\"\u003eread lock\u003c/a\u003e may be held simultaneously by multiple reader threads, so long as there are no writers. The \n\u003ca href\u003d\"#writeLock()\"\u003ewrite lock\u003c/a\u003e is exclusive. \n\u003cp\u003eAll \u003ccode\u003eReadWriteLock\u003c/code\u003e implementations must guarantee that the memory synchronization effects of \u003ccode\u003ewriteLock\u003c/code\u003e operations (as specified in the \u003ca href\u003d\"Lock.html\" title\u003d\"interface in java.util.concurrent.locks\"\u003e\u003ccode\u003eLock\u003c/code\u003e\u003c/a\u003e interface) also hold with respect to the associated \u003ccode\u003ereadLock\u003c/code\u003e. That is, a thread successfully acquiring the read lock will see all updates made upon previous release of the write lock. \u003c/p\u003e\n\u003cp\u003eA read-write lock allows for a greater level of concurrency in accessing shared data than that permitted by a mutual exclusion lock. It exploits the fact that while only a single thread at a time (a \u003cem\u003ewriter\u003c/em\u003e thread) can modify the shared data, in many cases any number of threads can concurrently read the data (hence \u003cem\u003ereader\u003c/em\u003e threads). In theory, the increase in concurrency permitted by the use of a read-write lock will lead to performance improvements over the use of a mutual exclusion lock. In practice this increase in concurrency will only be fully realized on a multi-processor, and then only if the access patterns for the shared data are suitable. \u003c/p\u003e\n\u003cp\u003eWhether or not a read-write lock will improve performance over the use of a mutual exclusion lock depends on the frequency that the data is read compared to being modified, the duration of the read and write operations, and the contention for the data - that is, the number of threads that will try to read or write the data at the same time. For example, a collection that is initially populated with data and thereafter infrequently modified, while being frequently searched (such as a directory of some kind) is an ideal candidate for the use of a read-write lock. However, if updates become frequent then the data spends most of its time being exclusively locked and there is little, if any increase in concurrency. Further, if the read operations are too short the overhead of the read-write lock implementation (which is inherently more complex than a mutual exclusion lock) can dominate the execution cost, particularly as many read-write lock implementations still serialize all threads through a small section of code. Ultimately, only profiling and measurement will establish whether the use of a read-write lock is suitable for your application. \u003c/p\u003e\n\u003cp\u003eAlthough the basic operation of a read-write lock is straight-forward, there are many policy decisions that an implementation must make, which may affect the effectiveness of the read-write lock in a given application. Examples of these policies include: \u003c/p\u003e\n\u003cul\u003e \n \u003cli\u003eDetermining whether to grant the read lock or the write lock, when both readers and writers are waiting, at the time that a writer releases the write lock. Writer preference is common, as writes are expected to be short and infrequent. Reader preference is less common as it can lead to lengthy delays for a write if the readers are frequent and long-lived as expected. Fair, or \"in-order\" implementations are also possible. \u003c/li\u003e\n \u003cli\u003eDetermining whether readers that request the read lock while a reader is active and a writer is waiting, are granted the read lock. Preference to the reader can delay the writer indefinitely, while preference to the writer can reduce the potential for concurrency. \u003c/li\u003e\n \u003cli\u003eDetermining whether the locks are reentrant: can a thread with the write lock reacquire it? Can it acquire a read lock while holding the write lock? Is the read lock itself reentrant? \u003c/li\u003e\n \u003cli\u003eCan the write lock be downgraded to a read lock without allowing an intervening writer? Can a read lock be upgraded to a write lock, in preference to other waiting readers or writers? \u003c/li\u003e\n\u003c/ul\u003e You should consider all of these things when evaluating the suitability of a given implementation for your application.\n\u003cp\u003e\u003c/p\u003e",
  "tagMap": {
    "see": [
      "\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/util/concurrent/locks/ReentrantReadWriteLock.html\" title\u003d\"class in java.util.concurrent.locks\"\u003e\u003ccode\u003eReentrantReadWriteLock\u003c/code\u003e\u003c/a\u003e, \n\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/util/concurrent/locks/Lock.html\" title\u003d\"interface in java.util.concurrent.locks\"\u003e\u003ccode\u003eLock\u003c/code\u003e\u003c/a\u003e, \n\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.base/java/util/concurrent/locks/ReentrantLock.html\" title\u003d\"class in java.util.concurrent.locks\"\u003e\u003ccode\u003eReentrantLock\u003c/code\u003e\u003c/a\u003e"
    ],
    "since": [
      "1.5"
    ]
  }
}