{
  "packageName": "javax.sql",
  "simpleName": "ConnectionEventListener",
  "moduleName": "java.sql",
  "type": "INTERFACE",
  "superClass": {
    "name": "java.util.EventListener",
    "type": "Class"
  },
  "members": [
    {
      "returnType": {
        "name": "void",
        "type": "Class"
      },
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "connectionClosed",
      "comment": "Notifies this ConnectionEventListener that the application has called the method close on its representation of a pooled connection.",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003eevent\u003c/code\u003e - an event object describing the source of the event"
        ]
      }
    },
    {
      "returnType": {
        "name": "void",
        "type": "Class"
      },
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "connectionErrorOccurred",
      "comment": "Notifies this ConnectionEventListener that a fatal error has occurred and the pooled connection can no longer be used. The driver makes this notification just before it throws the application the SQLException contained in the given ConnectionEvent object.",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003eevent\u003c/code\u003e - an event object describing the source of the event and containing the \n\u003ccode\u003eSQLException\u003c/code\u003e that the driver is about to throw"
        ]
      }
    }
  ],
  "memberType": "JavaClass",
  "modifiers": 513,
  "name": "javax.sql.ConnectionEventListener",
  "comment": "\u003cp\u003e An object that registers to be notified of events generated by a \u003ccode\u003ePooledConnection\u003c/code\u003e object. \u003c/p\u003e\n\u003cp\u003e The \u003ccode\u003eConnectionEventListener\u003c/code\u003e interface is implemented by a connection pooling component. A connection pooling component will usually be provided by a JDBC driver vendor or another system software vendor. A JDBC driver notifies a \u003ccode\u003eConnectionEventListener\u003c/code\u003e object when an application is finished using a pooled connection with which the listener has registered. The notification occurs after the application calls the method \u003ccode\u003eclose\u003c/code\u003e on its representation of a \u003ccode\u003ePooledConnection\u003c/code\u003e object. A \u003ccode\u003eConnectionEventListener\u003c/code\u003e is also notified when a connection error occurs due to the fact that the \u003ccode\u003ePooledConnection\u003c/code\u003e is unfit for future use---the server has crashed, for example. The listener is notified by the JDBC driver just before the driver throws an \u003ccode\u003eSQLException\u003c/code\u003e to the application using the \u003ccode\u003ePooledConnection\u003c/code\u003e object.\u003c/p\u003e",
  "tagMap": {
    "since": [
      "1.4"
    ]
  }
}