{
  "packageName": "javax.swing.text",
  "simpleName": "Position",
  "moduleName": "java.desktop",
  "type": "INTERFACE",
  "superClass": {
    "name": "java.lang.Object",
    "type": "Class"
  },
  "members": [
    {
      "returnType": {
        "name": "int",
        "type": "Class"
      },
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "getOffset",
      "comment": "Fetches the current offset within the document.",
      "tagMap": {
        "return": [
          "the offset \u0026gt;\u003d 0"
        ]
      }
    }
  ],
  "innerClasses": [
    "javax.swing.text.Position$Bias"
  ],
  "memberType": "JavaClass",
  "modifiers": 513,
  "name": "javax.swing.text.Position",
  "comment": "Represents a location within a document. It is intended to abstract away implementation details of the document and enable specification of positions within the document that are capable of tracking of change as the document is edited. \n\u003cp\u003e A \u003ccode\u003ePosition\u003c/code\u003e object points at a location between two characters. As the surrounding content is altered, the \u003ccode\u003ePosition\u003c/code\u003e object adjusts its offset automatically to reflect the changes. If content is inserted or removed before the \u003ccode\u003ePosition\u003c/code\u003e object\u0027s location, then the \u003ccode\u003ePosition\u003c/code\u003e increments or decrements its offset, respectively, so as to point to the same location. If a portion of the document is removed that contains a \u003ccode\u003ePosition\u003c/code\u003e\u0027s offset, then the \u003ccode\u003ePosition\u003c/code\u003e\u0027s offset becomes that of the beginning of the removed region. For example, if a \u003ccode\u003ePosition\u003c/code\u003e has an offset of 5 and the region 2-10 is removed, then the \u003ccode\u003ePosition\u003c/code\u003e\u0027s offset becomes 2. \u003c/p\u003e\n\u003cp\u003e \u003ccode\u003ePosition\u003c/code\u003e with an offset of 0 is a special case. It never changes its offset while document content is altered.\u003c/p\u003e",
  "tagMap": {}
}