{
  "packageName": "javax.naming.ldap",
  "simpleName": "ControlFactory",
  "moduleName": "java.naming",
  "type": "CLASS",
  "superClass": {
    "name": "java.lang.Object",
    "type": "Class"
  },
  "members": [
    {
      "returnType": {
        "name": "javax.naming.ldap.Control",
        "type": "Class"
      },
      "throwsClasses": [
        {
          "name": "javax.naming.NamingException",
          "type": "Class"
        }
      ],
      "parameters": [
        {
          "type": {
            "name": "javax.naming.ldap.Control",
            "type": "Class"
          },
          "field": {
            "name": "ctl"
          }
        }
      ],
      "memberType": "JavaMethod",
      "modifiers": 1025,
      "name": "getControlInstance",
      "comment": "Creates a control using this control factory. The factory is used by the service provider to return controls that it reads from the LDAP protocol as specialized control classes. Without this mechanism, the provider would be returning controls that only contained data in BER encoded format. Typically, ctl is a \"basic\" control containing BER encoded data. The factory is used to create a specialized control implementation, usually by decoding the BER encoded data, that provides methods to access that data in a type-safe and friendly manner. For example, a factory might use the BER encoded data in basic control and return an instance of a VirtualListReplyControl. If this factory cannot create a control using the argument supplied, it should return null. A factory should only throw an exception if it is sure that it is the only intended factory and that no other control factories should be tried. This might happen, for example, if the BER data in the control does not match what is expected of a control with the given OID. Since this method throws NamingException, any other internally generated exception that should be propagated must be wrapped inside a NamingException.",
      "tagMap": {
        "param": [
          "\u003ccode\u003ectl\u003c/code\u003e - A non-null control."
        ],
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.naming/javax/naming/NamingException.html\" title\u003d\"class in javax.naming\"\u003eNamingException\u003c/a\u003e\u003c/code\u003e - If \n\u003ccode\u003ectl\u003c/code\u003e contains invalid data that prevents it from being used to create a control. A factory should only throw an exception if it knows how to produce the control (identified by the OID) but is unable to because of, for example invalid BER data."
        ],
        "return": [
          "A possibly null Control."
        ]
      }
    },
    {
      "returnType": {
        "name": "javax.naming.ldap.Control",
        "type": "Class"
      },
      "throwsClasses": [
        {
          "name": "javax.naming.NamingException",
          "type": "Class"
        }
      ],
      "parameters": [
        {
          "type": {
            "name": "javax.naming.ldap.Control",
            "type": "Class"
          },
          "field": {
            "name": "ctl"
          }
        },
        {
          "type": {
            "name": "javax.naming.Context",
            "type": "Class"
          },
          "field": {
            "name": "ctx"
          }
        },
        {
          "type": {
            "name": "java.util.Hashtable",
            "parameters": [
              {
                "type": "Wildcard"
              },
              {
                "type": "Wildcard"
              }
            ],
            "type": "Class"
          },
          "field": {
            "name": "env"
          }
        }
      ],
      "memberType": "JavaMethod",
      "modifiers": 9,
      "name": "getControlInstance",
      "comment": "Creates a control using known control factories. The following rule is used to create the control: Use the control factories specified in the LdapContext.CONTROL_FACTORIES property of the environment, and of the provider resource file associated with ctx, in that order. The value of this property is a colon-separated list of factory class names that are tried in order, and the first one that succeeds in creating the control is the one used. If none of the factories can be loaded, return ctl. If an exception is encountered while creating the control, the exception is passed up to the caller. Note that a control factory must be public and must have a public constructor that accepts no arguments. In cases where the factory is in a named module then it must be in a package which is exported by that module to the java.naming module.",
      "tagMap": {
        "param": [
          "\u003ccode\u003ectl\u003c/code\u003e - The non-null control object containing the OID and BER data.",
          "\u003ccode\u003ectx\u003c/code\u003e - The possibly null context in which the control is being created. If null, no such information is available.",
          "\u003ccode\u003eenv\u003c/code\u003e - The possibly null environment of the context. This is used to find the value of the \n\u003ccode\u003eLdapContext.CONTROL_FACTORIES\u003c/code\u003e property."
        ],
        "throws": [
          "\u003ccode\u003e\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.naming/javax/naming/NamingException.html\" title\u003d\"class in javax.naming\"\u003eNamingException\u003c/a\u003e\u003c/code\u003e - if a naming exception was encountered while attempting to create the control object. If one of the factories accessed throws an exception, it is propagated up to the caller. If an error was encountered while loading and instantiating the factory and object classes, the exception is wrapped inside a \n\u003ccode\u003eNamingException\u003c/code\u003e and then rethrown."
        ],
        "return": [
          "A control object created using \n\u003ccode\u003ectl\u003c/code\u003e; or \n\u003ccode\u003ectl\u003c/code\u003e if a control object cannot be created using the algorithm described above."
        ]
      }
    },
    {
      "parameters": [],
      "memberType": "JavaMethod",
      "modifiers": 4,
      "comment": "Creates a new instance of a control factory.",
      "tagMap": {}
    }
  ],
  "memberType": "JavaClass",
  "modifiers": 1025,
  "name": "javax.naming.ldap.ControlFactory",
  "comment": "This abstract class represents a factory for creating LDAPv3 controls. LDAPv3 controls are defined in \n\u003ca href\u003d\"http://www.ietf.org/rfc/rfc2251.txt\"\u003eRFC 2251\u003c/a\u003e. \n\u003cp\u003e When a service provider receives a response control, it uses control factories to return the specific/appropriate control class implementation.\u003c/p\u003e",
  "tagMap": {
    "see": [
      "\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.naming/javax/naming/ldap/Control.html\" title\u003d\"interface in javax.naming.ldap\"\u003e\u003ccode\u003eControl\u003c/code\u003e\u003c/a\u003e"
    ],
    "since": [
      "1.3"
    ]
  }
}