{
  "packageName": "java.awt.im",
  "simpleName": "InputMethodRequests",
  "moduleName": "java.desktop",
  "type": "INTERFACE",
  "superClass": {
    "name": "java.lang.Object",
    "type": "Class"
  },
  "members": [
    {
      "returnType": {
        "name": "java.awt.Rectangle",
        "type": "Class"
      },
      "parameters": [
        {
          "annotations": [],
          "type": {
            "name": "java.awt.font.TextHitInfo",
            "type": "Class"
          },
          "name": "offset",
          "varargs": false
        }
      ],
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "getTextLocation",
      "comment": "Gets the location of a specified offset in the current composed text, or of the selection in committed text. This information is, for example, used to position the candidate window near the composed text, or a composition window near the location where committed text will be inserted. If the component has composed text (because the most recent InputMethodEvent sent to it contained composed text), then the offset is relative to the composed text - offset 0 indicates the first character in the composed text. The location returned should be for this character. If the component doesn\u0027t have composed text, the offset should be ignored, and the location returned should reflect the beginning (in line direction) of the highlight in the last line containing selected text. For example, for horizontal left-to-right text (such as English), the location to the left of the left-most character on the last line containing selected text is returned. For vertical top-to-bottom text, with lines proceeding from right to left, the location to the top of the left-most line containing selected text is returned. The location is represented as a 0-thickness caret, that is, it has 0 width if the text is drawn horizontally, and 0 height if the text is drawn vertically. Other text orientations need to be mapped to horizontal or vertical orientation. The rectangle uses absolute screen coordinates.",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003eoffset\u003c/code\u003e - the offset within the composed text, if there is composed text; null otherwise"
        ],
        "return": [
          "a rectangle representing the screen location of the offset"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.awt.font.TextHitInfo",
        "type": "Class"
      },
      "parameters": [
        {
          "annotations": [],
          "type": {
            "name": "int",
            "type": "Class"
          },
          "name": "x",
          "varargs": false
        },
        {
          "annotations": [],
          "type": {
            "name": "int",
            "type": "Class"
          },
          "name": "y",
          "varargs": false
        }
      ],
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "getLocationOffset",
      "comment": "Gets the offset within the composed text for the specified absolute x and y coordinates on the screen. This information is used, for example to handle mouse clicks and the mouse cursor. The offset is relative to the composed text, so offset 0 indicates the beginning of the composed text. Return null if the location is outside the area occupied by the composed text.",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003ex\u003c/code\u003e - the absolute x coordinate on screen",
          "\u003ccode\u003ey\u003c/code\u003e - the absolute y coordinate on screen"
        ],
        "return": [
          "a text hit info describing the offset in the composed text."
        ]
      }
    },
    {
      "returnType": {
        "name": "int",
        "type": "Class"
      },
      "parameters": [],
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "getInsertPositionOffset",
      "comment": "Gets the offset of the insert position in the committed text contained in the text editing component. This is the offset at which characters entered through an input method are inserted. This information is used by an input method, for example, to examine the text surrounding the insert position.",
      "annotations": [],
      "tagMap": {
        "return": [
          "the offset of the insert position"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.text.AttributedCharacterIterator",
        "type": "Class"
      },
      "parameters": [
        {
          "annotations": [],
          "type": {
            "name": "int",
            "type": "Class"
          },
          "name": "beginIndex",
          "varargs": false
        },
        {
          "annotations": [],
          "type": {
            "name": "int",
            "type": "Class"
          },
          "name": "endIndex",
          "varargs": false
        },
        {
          "annotations": [],
          "type": {
            "name": "java.text.AttributedCharacterIterator$Attribute",
            "type": "Class",
            "arrayDimensions": 1
          },
          "name": "attributes",
          "varargs": false
        }
      ],
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "getCommittedText",
      "comment": "Gets an iterator providing access to the entire text and attributes contained in the text editing component except for uncommitted text. Uncommitted (composed) text should be ignored for index calculations and should not be made accessible through the iterator. The input method may provide a list of attributes that it is interested in. In that case, information about other attributes that the implementor may have need not be made accessible through the iterator. If the list is null, all available attribute information should be made accessible.",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003ebeginIndex\u003c/code\u003e - the index of the first character",
          "\u003ccode\u003eendIndex\u003c/code\u003e - the index of the character following the last character",
          "\u003ccode\u003eattributes\u003c/code\u003e - a list of attributes that the input method is interested in"
        ],
        "return": [
          "an iterator providing access to the text and its attributes"
        ]
      }
    },
    {
      "returnType": {
        "name": "int",
        "type": "Class"
      },
      "parameters": [],
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "getCommittedTextLength",
      "comment": "Gets the length of the entire text contained in the text editing component except for uncommitted (composed) text.",
      "annotations": [],
      "tagMap": {
        "return": [
          "the length of the text except for uncommitted text"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.text.AttributedCharacterIterator",
        "type": "Class"
      },
      "parameters": [
        {
          "annotations": [],
          "type": {
            "name": "java.text.AttributedCharacterIterator$Attribute",
            "type": "Class",
            "arrayDimensions": 1
          },
          "name": "attributes",
          "varargs": false
        }
      ],
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "cancelLatestCommittedText",
      "comment": "Gets the latest committed text from the text editing component and removes it from the component\u0027s text body. This is used for the \"Undo Commit\" feature in some input methods, where the committed text reverts to its previous composed state. The composed text will be sent to the component using an InputMethodEvent. Generally, this feature should only be supported immediately after the text was committed, not after the user performed other operations on the text. When the feature is not supported, return null. The input method may provide a list of attributes that it is interested in. In that case, information about other attributes that the implementor may have need not be made accessible through the iterator. If the list is null, all available attribute information should be made accessible.",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003eattributes\u003c/code\u003e - a list of attributes that the input method is interested in"
        ],
        "return": [
          "the latest committed text, or null when the \"Undo Commit\" feature is not supported"
        ]
      }
    },
    {
      "returnType": {
        "name": "java.text.AttributedCharacterIterator",
        "type": "Class"
      },
      "parameters": [
        {
          "annotations": [],
          "type": {
            "name": "java.text.AttributedCharacterIterator$Attribute",
            "type": "Class",
            "arrayDimensions": 1
          },
          "name": "attributes",
          "varargs": false
        }
      ],
      "isDefaultMethod": false,
      "memberType": "JavaMethod",
      "modifiers": 0,
      "name": "getSelectedText",
      "comment": "Gets the currently selected text from the text editing component. This may be used for a variety of purposes. One of them is the \"Reconvert\" feature in some input methods. In this case, the input method will typically send an input method event to replace the selected text with composed text. Depending on the input method\u0027s capabilities, this may be the original composed text for the selected text, the latest composed text entered anywhere in the text, or a version of the text that\u0027s converted back from the selected text. The input method may provide a list of attributes that it is interested in. In that case, information about other attributes that the implementor may have need not be made accessible through the iterator. If the list is null, all available attribute information should be made accessible.",
      "annotations": [],
      "tagMap": {
        "param": [
          "\u003ccode\u003eattributes\u003c/code\u003e - a list of attributes that the input method is interested in"
        ],
        "return": [
          "the currently selected text"
        ]
      }
    }
  ],
  "memberType": "JavaClass",
  "modifiers": 513,
  "name": "java.awt.im.InputMethodRequests",
  "annotations": [],
  "tagMap": {
    "see": [
      "\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.desktop/java/awt/Component.html#getInputMethodRequests()\"\u003e\u003ccode\u003eComponent.getInputMethodRequests()\u003c/code\u003e\u003c/a\u003e, \n\u003ca href\u003d\"https://docs.oracle.com/en/java/javase/16/docs/api/java.desktop/java/awt/event/InputMethodListener.html\" title\u003d\"interface in java.awt.event\"\u003e\u003ccode\u003eInputMethodListener\u003c/code\u003e\u003c/a\u003e"
    ],
    "since": [
      "1.2"
    ]
  }
}